Aquidemia/app/views/gyms/favorites.html.erb

SELECT  "gyms".* FROM "gyms" WHERE "gyms"."id" = $1 LIMIT $2  [["id", 28], ["LIMIT", 1]]
---
    <% @gyms.each do |gym| %>
    <% if current_user.voted_for?(Gym.find(gym.id)) %>