Aquidemia/app/controllers/gyms_controller.rb

SELECT  "gyms".* FROM "gyms" WHERE "gyms"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def add_favorite
    begin
      @gym = Gym.find(params[:id])

SELECT  "gyms".* FROM "gyms" WHERE "gyms"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def vote_up
    begin
      @gym = Gym.find(params[:id])

SELECT  "gyms".* FROM "gyms" WHERE "gyms"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def vote_down
    begin
      @gym = Gym.find(params[:id])

SELECT  "gyms".* FROM "gyms" WHERE "gyms"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @gym = Gym.find(params[:id])

SELECT  "gyms".* FROM "gyms" WHERE "gyms"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_gym
      @gym = Gym.find(params[:id])