Aquidemia/app/controllers/pages_controller.rb

  def gyms
    @gyms = Gym.all
---
SELECT "gyms".* FROM "gyms"

  def search
    @gyms = Gym.all
---
SELECT "gyms".* FROM "gyms"