Aquidemia/app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."uid" = $1 LIMIT $2  [["uid", "12345678910"], ["LIMIT", 1]]
UPDATE "users" SET "oauth_expires_at" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["oauth_expires_at", "2018-05-28 18:24:47"], ["updated_at", "2018-05-28 18:24:46.782284"], ["id", 3]]
---
  def create
    user = User.update_or_create(request.env["omniauth.auth"])